app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::with('user')
            ->where('is_draft', '1')
            ->latest()
            ->paginate(20);
---
select * from `posts` where `is_draft` = '1' order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select count(*) as aggregate from `posts` where `is_draft` = '1'

    public function show($id)
    {
        $post = Post::with('user')
            ->where('id', $id)
            ->where('is_draft', false)
            ->where(function ($q) {
                $q->whereNull('published_at')
                    ->orWhere('published_at', '<=', now());
            })
            ->firstOrFail();
---
select * from `posts` where `id` = '83' and `is_draft` = 0 and (`published_at` is null or `published_at` <= '2026-02-09 06:28:44') limit 1
select * from `users` where `users`.`id` in (10)